var q1=[
    {
        bt: '血战麻将起源于哪个地区？',
        sure: 'C',
        res: [
            {
                name:'A、东京',
            },
            {
                name:'B、巴黎',
            },
            {
                name:'C、四川',
            },
            {
                name:'D、土耳其',
            }
        ]
    },
    {
        bt: '一个玩家最多可能抓到几个杠？',
        sure: 'D',
        res: [
            {
                name:'A、1个',
            },
            {
                name:'B、2个',
            },
            {
                name:'C、3个',
            },
            {
                name:'D、4个',
            }
        ]
    },
    {
        bt: '在血战麻将中，以下哪个牌型无法实现?',
        sure: 'B',
        res: [
            {
                name:'A、清一色',
            },
            {
                name:'B、十三幺',
            },
            {
                name:'C、碰碰胡',
            },
            {
                name:'D、清钩钓',
            }
        ]
    },
    {
        bt: '在麻将牌中，同一张牌有几张？',
        sure: 'D',
        res: [
            {
                name:'A、1',
            },
            {
                name:'B、2',
            },
            {
                name:'C、3',
            },
            {
                name:'D、4',
            }
        ]
    },
    {
        bt: '八筒是什么颜色的？',
        sure: 'C',
        res: [
            {
                name:'A、红色',
            },
            {
                name:'B、绿色',
            },
            {
                name:'C、紫黑色',
            },
            {
                name:'D、黄色',
            }
        ]
    },
    {
        bt: '在四川话中，一筒的别称是？',
        sure: 'B',
        res: [
            {
                name:'A、圆圈',
            },
            {
                name:'B、馍馍',
            },
            {
                name:'C、太阳',
            },
            {
                name:'D、煎饼',
            }
        ]
    },
    {
        bt: '听牌后启动托管，会发生什么？',
        sure: 'D',
        res: [
            {
                name:'A、必然自摸',
            },
            {
                name:'B、打掉自摸',
            },
            {
                name:'C、立刻点炮',
            },
            {
                name:'D、遇胡则胡',
            }
        ]
    },
    {
        bt: '麻将牌中的一条上面画了一只？',
        sure: 'C',
        res: [
            {
                name:'A、龙',
            },
            {
                name:'B、凤',
            },
            {
                name:'C、鸟',
            },
            {
                name:'D、猪',
            }
        ]
    },
    {
        bt: '血战玩法开局前需要做什么？',
        sure: 'D',
        res: [
            {
                name:'A、洗手',
            },
            {
                name:'B、充值',
            },
            {
                name:'C、占卜',
            },
            {
                name:'D、定缺',
            }
        ]
    },
    {
        bt: '下列哪个不是五筒的别称？',
        sure: 'A',
        res: [
            {
                name:'A、五险一金',
            },
            {
                name:'B、中原一点红',
            },
            {
                name:'C、四菜一汤',
            },
            {
                name:'D、五饼',
            }
        ]
    },
    {
        bt: '在四川话中，一万牌又叫做？',
        sure: 'A',
        res: [
            {
                name:'A、扁担',
            },
            {
                name:'B、板凳',
            },
            {
                name:'C、幺鸡',
            },
            {
                name:'D、一根',
            }
        ]
    },
    {
        bt: '四张一样的牌称作？',
        sure: 'C',
        res: [
            {
                name:'A、炸弹',
            },
            {
                name:'B、三带一',
            },
            {
                name:'C、杠',
            },
            {
                name:'D、飞机',
            }
        ]
    },
    {
        bt: '下列麻将中，哪一张的图案是非对称的？',
        sure: 'D',
        res: [
            {
                name:'A、八条',
            },
            {
                name:'B、九筒',
            },
            {
                name:'C、白板',
            },
            {
                name:'D、五万',
            }
        ]
    },
    {
        bt: '下列哪一个不是四万牌在四川话中的别称？',
        sure: 'D',
        res: [
            {
                name:'A、门牙',
            },
            {
                name:'B、驼背',
            },
            {
                name:'C、狗牙巴',
            },
            {
                name:'D、风湿',
            }
        ]
    },
    {
        bt: '当一家胡牌后，剩下三家杠、胡牌的输赢与谁无关？',
        sure: 'A',
        res: [
            {
                name:'A、第一家',
            },
            {
                name:'B、庄家',
            },
            {
                name:'C、下家',
            },
            {
                name:'D、对家',
            }
        ]
    },
    {
        bt: '牌局开始时，每一家手上有多少张牌？',
        sure: 'A',
        res: [
            {
                name:'A、13张',
            },
            {
                name:'B、12张',
            },
            {
                name:'C、11张',
            },
            {
                name:'D、10张',
            }
        ]
    },
    {
        bt: '麻将术语下叫是什么意思？',
        sure: 'C',
        res: [
            {
                name:'A、自摸',
            },
            {
                name:'B、暗杠',
            },
            {
                name:'C、听牌',
            },
            {
                name:'D、点炮',
            }
        ]
    },
    {
        bt: '下列哪种情况和杠牌无关？',
        sure: 'D',
        res: [
            {
                name:'A、呼叫转移',
            },
            {
                name:'B、抢杠胡',
            },
            {
                name:'C、杠上开花',
            },
            {
                name:'D、查大叫',
            }
        ]
    },
    {
        bt: '赖子牌不能组成下列哪种牌型？',
        sure: 'C',
        res: [
            {
                name:'A、顺子',
            },
            {
                name:'B、刻字',
            },
            {
                name:'C、杠',
            },
            {
                name:'D、将牌',
            }
        ]
    },
    {
        bt: '下列那张牌不是纯绿色的？',
        sure: 'D',
        res: [
            {
                name:'A、三条',
            },
            {
                name:'B、四条',
            },
            {
                name:'C、二条',
            },
            {
                name:'D、七条',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，玩家可能胡以下哪一张牌？',
        sure: 'B',
        res: [
            {
                name:'A、十筒',
            },
            {
                name:'B、三万',
            },
            {
                name:'C、南风',
            },
            {
                name:'D、大王',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，一共有多少张牌？',
        sure: 'D',
        res: [
            {
                name:'A、144',
            },
            {
                name:'B、136',
            },
            {
                name:'C、122',
            },
            {
                name:'D、108',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，下列哪个操作不是在流局时发生的？',
        sure: 'D',
        res: [
            {
                name:'A、查大叫',
            },
            {
                name:'B、查花猪',
            },
            {
                name:'C、退税',
            },
            {
                name:'D、定缺',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，以下哪个牌型的倍数是最高的？',
        sure: 'C',
        res: [
            {
                name:'A、碰碰胡',
            },
            {
                name:'B、清一色',
            },
            {
                name:'C、龙七对',
            },
            {
                name:'D、一九牌',
            }
        ]
    },
    {
        bt: '血战赖子玩法中摸到第4个赖子，可以怎么用？',
        sure: 'B',
        res: [
            {
                name:'A、当任意牌',
            },
            {
                name:'B、单局赖子最多3个',
            },
            {
                name:'C、运气不错,买彩票去',
            },
            {
                name:'D、杠一下',
            }
        ]
    },
    {
        bt: '血战赖子玩法中不允许?',
        sure: 'A',
        res: [
            {
                name:'A、吃牌',
            },
            {
                name:'B、碰牌',
            },
            {
                name:'C、杠牌',
            },
            {
                name:'D、胡牌',
            }
        ]
    },
    {
        bt: '血战赖子玩法中,一炮多响时并结束游戏时，下一轮庄家是?',
        sure: 'A',
        res: [
            {
                name:'A、上一把点炮人',
            },
            {
                name:'B、上把庄家',
            },
            {
                name:'C、投筛子决定',
            },
            {
                name:'D、谁都行',
            }
        ]
    },
    {
        bt: '血战赖子玩法中,哪种情况不能胡牌?',
        sure: 'D',
        res: [
            {
                name:'A、4副顺子加一对',
            },
            {
                name:'B、4个杠加一对',
            },
            {
                name:'C、7副对子',
            },
            {
                name:'D、3副顺子加两对',
            }
        ]
    },
    {
        bt: '血战赖子玩法中,"刮风"是指?',
        sure: 'B',
        res: [
            {
                name:'A、听牌',
            },
            {
                name:'B、明杠',
            },
            {
                name:'C、胡牌',
            },
            {
                name:'D、碰牌',
            }
        ]
    },
    {
        bt: '在血战赖子玩法中，不能进行以下哪个操作？',
        sure: 'A',
        res: [
            {
                name:'A、吃',
            },
            {
                name:'B、碰',
            },
            {
                name:'C、杠',
            },
            {
                name:'D、听',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，玩家若有赖子的话，最多能胡多少张牌？',
        sure: 'A',
        res: [
            {
                name:'A、任意牌',
            },
            {
                name:'B、5张',
            },
            {
                name:'C、7张',
            },
            {
                name:'D、9张',
            }
        ]
    },
    {
        bt: '血战赖子玩法中最多可以点几个炮？',
        sure: 'C',
        res: [
            {
                name:'A、一个',
            },
            {
                name:'B、两个',
            },
            {
                name:'C、三个',
            },
            {
                name:'D、四个',
            }
        ]
    },
    {
        bt: '血战赖子玩法目前封顶是多少倍？',
        sure: 'C',
        res: [
            {
                name:'A、16倍',
            },
            {
                name:'B、24倍',
            },
            {
                name:'C、32倍',
            },
            {
                name:'D、48倍',
            }
        ]
    },
    {
        bt: '新的娱乐模式内容是？',
        sure: 'B',
        res: [
            {
                name:'A、广东麻将',
            },
            {
                name:'B、赖子血战',
            },
            {
                name:'C、长沙麻将',
            },
            {
                name:'D、血流成河',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，摸完所有牌时，若手上有种花色的牌则会被？',
        sure: 'C',
        res: [
            {
                name:'A、查花狗',
            },
            {
                name:'B、查花牛',
            },
            {
                name:'C、查花猪',
            },
            {
                name:'D、查花羊',
            }
        ]
    },
    {
        bt: '血战赖子玩法胡牌时，手牌中最多出现几种花色？',
        sure: 'B',
        res: [
            {
                name:'A、一种',
            },
            {
                name:'B、两种',
            },
            {
                name:'C、三种',
            },
            {
                name:'D、四种',
            }
        ]
    },
    {
        bt: '血战赖子玩法中的赖子牌是？',
        sure: 'A',
        res: [
            {
                name:'A、红中',
            },
            {
                name:'B、白板',
            },
            {
                name:'C、发财',
            },
            {
                name:'D、东风',
            }
        ]
    },
    {
        bt: '血战赖子玩法中没有下面哪种牌？',
        sure: 'D',
        res: [
            {
                name:'A、条牌',
            },
            {
                name:'B、筒牌',
            },
            {
                name:'C、万牌',
            },
            {
                name:'D、风牌',
            }
        ]
    },
    {
        bt: '血战赖子玩法中的赖子有什么用？',
        sure: 'D',
        res: [
            {
                name:'A、换取欢乐豆',
            },
            {
                name:'B、换一张牌',
            },
            {
                name:'C、加倍',
            },
            {
                name:'D、替代任意一张牌',
            }
        ]
    },
    {
        bt: '以下哪种牌型可以在血战赖子玩法中出现？',
        sure: 'A',
        res: [
            {
                name:'A、清一色',
            },
            {
                name:'B、十三幺',
            },
            {
                name:'C、大四喜',
            },
            {
                name:'D、小三元',
            }
        ]
    },
    {
        bt: '在血战麻将赖子玩法中，明杠又称什么？',
        sure: 'A',
        res: [
            {
                name:'A、刮风',
            },
            {
                name:'B、下雨',
            },
            {
                name:'C、闪电',
            },
            {
                name:'D、雷鸣',
            }
        ]
    },
    {
        bt: '在血战麻将赖子玩法中，暗杠又称什么？',
        sure: 'B',
        res: [
            {
                name:'A、下雪',
            },
            {
                name:'B、下雨',
            },
            {
                name:'C、下冰雹',
            },
            {
                name:'D、下跪',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，如果打出一张牌后，有两家都胡这张牌，那么？',
        sure: 'D',
        res: [
            {
                name:'A、两家都不胡',
            },
            {
                name:'B、第三家胡',
            },
            {
                name:'C、自己胡',
            },
            {
                name:'D、一炮双响',
            }
        ]
    },
    {
        bt: '以下哪种牌型在血战赖子玩法中不计番数?',
        sure: 'C',
        res: [
            {
                name:'A、七小对',
            },
            {
                name:'B、碰碰胡',
            },
            {
                name:'C、一条龙',
            },
            {
                name:'D、天胡',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，在所有牌摸完后，有杠牌但是没有听牌的玩家他会被？',
        sure: 'D',
        res: [
            {
                name:'A、纳税',
            },
            {
                name:'B、缴税',
            },
            {
                name:'C、补税',
            },
            {
                name:'D、退税',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，没有赖子可不可以胡牌？',
        sure: 'D',
        res: [
            {
                name:'A、不可以',
            },
            {
                name:'B、不知道',
            },
            {
                name:'C、看牌型',
            },
            {
                name:'D、可以',
            }
        ]
    },
    {
        bt: '下列哪个不是血战赖子玩法的特点？',
        sure: 'C',
        res: [
            {
                name:'A、需要缺一门花色',
            },
            {
                name:'B、一家胡牌不结束',
            },
            {
                name:'C、只能胡一门花色',
            },
            {
                name:'D、没有风牌箭牌',
            }
        ]
    },
    {
        bt: '玩家若杠上炮的话会发生？',
        sure: 'B',
        res: [
            {
                name:'A、呼叫等待',
            },
            {
                name:'B、呼叫转移',
            },
            {
                name:'C、呼叫正忙',
            },
            {
                name:'D、呼叫无法接通',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，天胡时结算多少番?',
        sure: 'D',
        res: [
            {
                name:'A、三番',
            },
            {
                name:'B、四番',
            },
            {
                name:'C、五番',
            },
            {
                name:'D、六番',
            }
        ]
    },
    {
        bt: '血战赖子玩法中，下列哪一个操作会增加胡牌番数？',
        sure: 'A',
        res: [
            {
                name:'A、杠',
            },
            {
                name:'B、碰',
            },
            {
                name:'C、吃',
            },
            {
                name:'D、听',
            }
        ]
    },
    {
        bt: '赖子血战玩法上线时间是？',
        sure: 'C',
        res: [
            {
                name:'A、昨天',
            },
            {
                name:'B、前天',
            },
            {
                name:'C、10月22日',
            },
            {
                name:'D、大前天',
            }
        ]
    }
]    